app/views/books/_form.html.erb

    <%= f.label :publish_id %><br>
    <%= collection_select(:book, :publish_id, Publish.all, :id, :publishname)%>
---
SELECT "publishes".* FROM "publishes"