app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("isbn", "title", "publish_id", "cd", "published", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["isbn", "1"], ["title", ""], ["publish_id", "1"], ["cd", "f"], ["published", "2016-07-12"], ["created_at", "2016-07-12 07:11:47.076783"], ["updated_at", "2016-07-12 07:11:47.076783"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "title" = ?, "price" = ?, "publish" = ?, "published" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "aaa"], ["price", 1000], ["publish", "kodan"], ["published", "2014-09-25"], ["updated_at", "2016-04-25 01:05:38.857011"], ["id", 1]]

  def search
    @books = Book.where(cd: true)
---
SELECT "books".* FROM "books" WHERE "books"."cd" = ?  [["cd", "t"]]