app/controllers/books_controller.rb

  def search
    @value = params["search"]["title"]
    @books = Book.where("title LIKE '%#{params["search"]["title"]}%'")
---
SELECT "books".* FROM "books" WHERE "books"."title" = ?  [["title", "123"]]