app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("userid", "username", "password", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["userid", "765"], ["username", "jhy"], ["password", "jytg"], ["email", "jg"], ["created_at", "2016-07-12 08:05:59.006950"], ["updated_at", "2016-07-12 08:05:59.006950"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "userid" = ?, "username" = ?, "password" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["userid", "1"], ["username", "深野"], ["password", "f"], ["email", "ffffff"], ["updated_at", "2016-07-12 08:15:52.385513"], ["id", 1]]